  /*주의!
   * 자바 언어는 대소문자를 구분한다. 대소문자가 다르면 오류가 발생할 수 있다.
   */

public class HelloJava {
// HelloJava를 클래스라 한다.

    public static void main(String[] args) {
        // main 메서드(함수)라 한다.
        // 자바는 main(String[] args) 메서드를 찾아서 프로그램을 시작한다.
        System.out.println("hello java");
        // 값을 콘솔창에 출력하는 기능이다.
        // 자바는 문자열을 사용할 때 ("")(쌍따옴표)로 시작하고 끝난다.
        // 자바는 ;(세미콜론)으로 문장을 구분한다. 문장이 끝나면 세미콜론을 필수로 넣어주어야 한다.

        // 블록 { }이 시작되고 끝날 때 마다 들여쓰기가 적용되어 있다. 이것은 코드를 쉽게 구분하고 이해하도록 도와주는 관례이다.
        // 들여쓰기는 보통 스페이스 4번을 사용한다.
    }
}
